<?php

namespace Database\Seeders;

use App\Models\Region;
use Illuminate\Database\Seeder;

class RegionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $regions = [
            ['name' => 'Адыгея'],
            ['name' => 'Башкортостан'],
            ['name' => 'Бурятия'],
            ['name' => 'Алтай'],
            ['name' => 'Дагестан'],
            ['name' => 'Ингушетия'],
            ['name' => 'Кабардино-Балкарская'],
            ['name' => 'Калмыкия'],
            ['name' => 'Карачаево-Черкесская'],
            ['name' => 'Карелия'],
            ['name' => 'Коми'],
            ['name' => 'Марий Эл'],
            ['name' => 'Мордовия'],
            ['name' => 'Саха /Якутия/'],
            ['name' => 'Северная Осетия - Алания'],
            ['name' => 'Татарстан'],
            ['name' => 'Тыва'],
            ['name' => 'Удмуртская'],
            ['name' => 'Хакасия'],
            ['name' => 'Чеченская'],
            ['name' => 'Чувашская Республика'],
            ['name' => 'Алтайский'],
            ['name' => 'Краснодарский'],
            ['name' => 'Красноярский'],
            ['name' => 'Приморский'],
            ['name' => 'Ставропольский'],
            ['name' => 'Хабаровский'],
            ['name' => 'Амурская'],
            ['name' => 'Архангельская'],
            ['name' => 'Астраханская'],
            ['name' => 'Белгородская'],
            ['name' => 'Брянская'],
            ['name' => 'Владимирская'],
            ['name' => 'Волгоградская'],
            ['name' => 'Вологодская'],
            ['name' => 'Воронежская'],
            ['name' => 'Ивановская'],
            ['name' => 'Иркутская'],
            ['name' => 'Калининградская'],
            ['name' => 'Калужская'],
            ['name' => 'Камчатский'],
            ['name' => 'Кемеровская область - Кузбасс'],
            ['name' => 'Кировская'],
            ['name' => 'Костромская'],
            ['name' => 'Курганская'],
            ['name' => 'Курская'],
            ['name' => 'Ленинградская'],
            ['name' => 'Липецкая'],
            ['name' => 'Магаданская'],
            ['name' => 'Московская'],
            ['name' => 'Мурманская'],
            ['name' => 'Нижегородская'],
            ['name' => 'Новгородская'],
            ['name' => 'Новосибирская'],
            ['name' => 'Омская'],
            ['name' => 'Оренбургская'],
            ['name' => 'Орловская'],
            ['name' => 'Пензенская'],
            ['name' => 'Пермский'],
            ['name' => 'Псковская'],
            ['name' => 'Ростовская'],
            ['name' => 'Рязанская'],
            ['name' => 'Самарская'],
            ['name' => 'Саратовская'],
            ['name' => 'Сахалинская'],
            ['name' => 'Свердловская'],
            ['name' => 'Смоленская'],
            ['name' => 'Тамбовская'],
            ['name' => 'Тверская'],
            ['name' => 'Томская'],
            ['name' => 'Тульская'],
            ['name' => 'Тюменская'],
            ['name' => 'Ульяновская'],
            ['name' => 'Челябинская'],
            ['name' => 'Забайкальский'],
            ['name' => 'Ярославская'],
            ['name' => 'Москва'],
            ['name' => 'Санкт-Петербург'],
            ['name' => 'Еврейская'],
            ['name' => 'Ненецкий'],
            ['name' => 'Ханты-Мансийский Автономный округ'],
            ['name' => 'Чукотский'],
            ['name' => 'Ямало-Ненецкий'],
            ['name' => 'Крым'],
            ['name' => 'Севастополь'],
            ['name' => 'Байконур'],
        ];

        foreach ($regions as $region) {
            Region::create($region);
        }
    }
}
